
{
    "income_too_low" : 
        "Income does not meet requirement",
    "bank_balance_too_low" : 
        "Bank account balance is too low",
    "income_unpredictable" : 
        "Unable to predict regular pattern of income deposits", 
    "user_account_duplicate" : 
        "Duplicate account (previously applied for a loan with a different email address)", 
    "sdb_check_failed" : 
        "State database lending restriction", 
    "bank_account_linking_error" : 
        "Unable to link to a supported banking institution",
    "mla_failed" : 
        "Under the Military Lending Act, loans to military personnel or their spouses and dependents cannot be made if the interest and expenses associated with the loan exceed an annual percentage rate (APR) of 36%. Due to these limits on military-related lending, we can't lend to members of the military or their spouses and dependents. Please feel free to contact us with any questions you may have about this notice!", 
    "iddoc_failed" : 
        "Unable to verify identification documents",
    "no_checking_or_savings_data": 
        "No data from supported financial institution. Unsupported financial institution is linked", 
    "insufficient_bank_history" : 
        "Unable to pull enough bank history", 
    "loan_location_no_license" :   
        "Unable to verify that your permanent residence is in a state",
    "address_invalid" : 
        "Unable to verify mailing address", 
    "income_verification_failed" : 
        "Unable to verify qualified income over a sustained period", 
    "stacking_behavior" : 
        "Recent deposits and withdrawals detected from other lenders", 
    "ssn_verification_failed" : 
        "Unable to verify SSN number", 
    "too_many_nsfs" : 
        "Multiple Returned checks or Insufficient Fund Fees detected", 
    "fraud_risk_too_high" : 
        "Bank account has been flagged as potential fraud risk",
    "has_bankruptcy_history" : 
        "History of bankruptcy",  
    "processor_suspended" : 
        "Payment processor is unable to authenticate user",
    "cash_flow_verification_failed" : 
        "Cash flow analysis - income funds are quickly depleted from bank account after income deposit",
    "credit_score_too_low" : 
        "Your credit score does not meet our requirement"
}